practice dataset

In [98]:
import pandas as pd

data ko load kiya

In [99]:
df = pd.read_csv('missing_values_data.csv')

In [100]:
df.head()

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12-11-2019

In [101]:
df.tail()

      Name   Age      City Gender              Email   Join Date
4    David  22.0    Mumbai      M  david@example.com  12-11-2019
5      NaN  28.0     Delhi      F     eve@domain.com         NaN
6    Alice  25.0  New York      F  alice@example.com  01-05-2021
7    Alice  25.0  New York      F  alice@example.com  01-05-2021
8  Charlie   NaN     Delhi      M    charlie@example  20-07-2021

In [102]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Name       8 non-null      object
 1   Age        6 non-null      float64
 2   City       9 non-null      object
 3   Gender     9 non-null      object
 4   Email      9 non-null      object
 5   Join Date  8 non-null      object
dtypes: float64(1), object(5)
memory usage: 564.0+ bytes

In [103]:
df.duplicated()

0    False
1    False
2    False
3     True
4    False
5    False
6     True
7     True
8     True
dtype: bool

In [104]:
df.drop_duplicates()

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
5      NaN  28.0        Delhi      F     eve@domain.com         NaN

In [105]:
df.isna().sum()

Name         1
Age          3
City         0
Gender       0
Email        0
Join Date    1
dtype: int64

In [106]:
df.columns

Index(['Name', 'Age', 'City', 'Gender', 'Email', 'Join Date'], dtype='object')

In [107]:
df['Age'].fillna(df['Age'].mean(),inplace= True)

/tmp/ipykernel_561/1280160446.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean(),inplace= True)

In [108]:
df['Age'] = df['Age'].round().astype(int)

In [109]:
df

      Name  Age         City Gender              Email   Join Date
0    Alice   25     New York      F  alice@example.com  01-05-2021
1  Charlie   26        Delhi      M    charlie@example  20-07-2021
2      Bob   30  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie   26        Delhi      M    charlie@example  20-07-2021
4    David   22       Mumbai      M  david@example.com  12-11-2019
5      NaN   28        Delhi      F     eve@domain.com         NaN
6    Alice   25     New York      F  alice@example.com  01-05-2021
7    Alice   25     New York      F  alice@example.com  01-05-2021
8  Charlie   26        Delhi      M    charlie@example  20-07-2021

In [110]:
df['Join Date'].fillna(df['Join Date'].mode()[0],inplace = True)

/tmp/ipykernel_561/1293693006.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Join Date'].fillna(df['Join Date'].mode()[0],inplace = True)

In [111]:
df

      Name  Age         City Gender              Email   Join Date
0    Alice   25     New York      F  alice@example.com  01-05-2021
1  Charlie   26        Delhi      M    charlie@example  20-07-2021
2      Bob   30  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie   26        Delhi      M    charlie@example  20-07-2021
4    David   22       Mumbai      M  david@example.com  12-11-2019
5      NaN   28        Delhi      F     eve@domain.com  01-05-2021
6    Alice   25     New York      F  alice@example.com  01-05-2021
7    Alice   25     New York      F  alice@example.com  01-05-2021
8  Charlie   26        Delhi      M    charlie@example  20-07-2021

In [112]:
df['Name'].fillna(df['Name'].mode()[0],inplace = True)

/tmp/ipykernel_561/1076262876.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Name'].fillna(df['Name'].mode()[0],inplace = True)

In [113]:
df

      Name  Age         City Gender              Email   Join Date
0    Alice   25     New York      F  alice@example.com  01-05-2021
1  Charlie   26        Delhi      M    charlie@example  20-07-2021
2      Bob   30  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie   26        Delhi      M    charlie@example  20-07-2021
4    David   22       Mumbai      M  david@example.com  12-11-2019
5    Alice   28        Delhi      F     eve@domain.com  01-05-2021
6    Alice   25     New York      F  alice@example.com  01-05-2021
7    Alice   25     New York      F  alice@example.com  01-05-2021
8  Charlie   26        Delhi      M    charlie@example  20-07-2021

In [114]:
(df['Name'] == 'Alice').sum()

np.int64(4)

In [115]:
df[(df['Age']> 20) & (df['City'] =='Delhi')]

      Name  Age   City Gender            Email   Join Date
1  Charlie   26  Delhi      M  charlie@example  20-07-2021
3  Charlie   26  Delhi      M  charlie@example  20-07-2021
5    Alice   28  Delhi      F   eve@domain.com  01-05-2021
8  Charlie   26  Delhi      M  charlie@example  20-07-2021

In [116]:
df['Email'].str.split('@')

0    [alice, example.com]
1      [charlie, example]
2      [bob, example.com]
3      [charlie, example]
4    [david, example.com]
5       [eve, domain.com]
6    [alice, example.com]
7    [alice, example.com]
8      [charlie, example]
Name: Email, dtype: object

In [117]:
df

      Name  Age         City Gender              Email   Join Date
0    Alice   25     New York      F  alice@example.com  01-05-2021
1  Charlie   26        Delhi      M    charlie@example  20-07-2021
2      Bob   30  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie   26        Delhi      M    charlie@example  20-07-2021
4    David   22       Mumbai      M  david@example.com  12-11-2019
5    Alice   28        Delhi      F     eve@domain.com  01-05-2021
6    Alice   25     New York      F  alice@example.com  01-05-2021
7    Alice   25     New York      F  alice@example.com  01-05-2021
8  Charlie   26        Delhi      M    charlie@example  20-07-2021

In [118]:
df['Gender'].str.contains('m',case = False).sum()

np.int64(5)

In [119]:
df.query('Name == "David" and City == "Mumbai"')

    Name  Age    City Gender              Email   Join Date
4  David   22  Mumbai      M  david@example.com  12-11-2019

In [120]:
df[(df['Name'] =='David') & (df['City'] =='Mumbai')]

    Name  Age    City Gender              Email   Join Date
4  David   22  Mumbai      M  david@example.com  12-11-2019

In [121]:
df.ffill()

      Name  Age         City Gender              Email   Join Date
0    Alice   25     New York      F  alice@example.com  01-05-2021
1  Charlie   26        Delhi      M    charlie@example  20-07-2021
2      Bob   30  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie   26        Delhi      M    charlie@example  20-07-2021
4    David   22       Mumbai      M  david@example.com  12-11-2019
5    Alice   28        Delhi      F     eve@domain.com  01-05-2021
6    Alice   25     New York      F  alice@example.com  01-05-2021
7    Alice   25     New York      F  alice@example.com  01-05-2021
8  Charlie   26        Delhi      M    charlie@example  20-07-2021

In [122]:
df.bfill()

      Name  Age         City Gender              Email   Join Date
0    Alice   25     New York      F  alice@example.com  01-05-2021
1  Charlie   26        Delhi      M    charlie@example  20-07-2021
2      Bob   30  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie   26        Delhi      M    charlie@example  20-07-2021
4    David   22       Mumbai      M  david@example.com  12-11-2019
5    Alice   28        Delhi      F     eve@domain.com  01-05-2021
6    Alice   25     New York      F  alice@example.com  01-05-2021
7    Alice   25     New York      F  alice@example.com  01-05-2021
8  Charlie   26        Delhi      M    charlie@example  20-07-2021

In [123]:
type(df['Join Date'])

pandas.core.series.Series

In [124]:
df['Name'].str.title()

0      Alice
1    Charlie
2        Bob
3    Charlie
4      David
5      Alice
6      Alice
7      Alice
8    Charlie
Name: Name, dtype: object

In [125]:
df

      Name  Age         City Gender              Email   Join Date
0    Alice   25     New York      F  alice@example.com  01-05-2021
1  Charlie   26        Delhi      M    charlie@example  20-07-2021
2      Bob   30  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie   26        Delhi      M    charlie@example  20-07-2021
4    David   22       Mumbai      M  david@example.com  12-11-2019
5    Alice   28        Delhi      F     eve@domain.com  01-05-2021
6    Alice   25     New York      F  alice@example.com  01-05-2021
7    Alice   25     New York      F  alice@example.com  01-05-2021
8  Charlie   26        Delhi      M    charlie@example  20-07-2021

In [126]:
df['new_age']=df['Age'].apply(lambda y: 'adult' if  y>=18 else 'tennage')

In [127]:
df['new_age']

0    adult
1    adult
2    adult
3    adult
4    adult
5    adult
6    adult
7    adult
8    adult
Name: new_age, dtype: object

In [128]:
df

      Name  Age         City Gender              Email   Join Date new_age
0    Alice   25     New York      F  alice@example.com  01-05-2021   adult
1  Charlie   26        Delhi      M    charlie@example  20-07-2021   adult
2      Bob   30  Los Angeles      M    bob@example.com  15-06-2020   adult
3  Charlie   26        Delhi      M    charlie@example  20-07-2021   adult
4    David   22       Mumbai      M  david@example.com  12-11-2019   adult
5    Alice   28        Delhi      F     eve@domain.com  01-05-2021   adult
6    Alice   25     New York      F  alice@example.com  01-05-2021   adult
7    Alice   25     New York      F  alice@example.com  01-05-2021   adult
8  Charlie   26        Delhi      M    charlie@example  20-07-2021   adult

In [131]:
df['Gender'] = df['Gender'].replace("{'F':'Female', 'M': 'Male'}")

/tmp/ipykernel_561/3989210932.py:1: FutureWarning: Series.replace without 'value' and with non-dict-like 'to_replace' is deprecated and will raise in a future version. Explicitly specify the new values instead.
  df['Gender'] = df['Gender'].replace("{'F':'Female', 'M': 'Male'}")

In [132]:
df

      Name  Age         City Gender              Email   Join Date new_age
0    Alice   25     New York      F  alice@example.com  01-05-2021   adult
1  Charlie   26        Delhi      M    charlie@example  20-07-2021   adult
2      Bob   30  Los Angeles      M    bob@example.com  15-06-2020   adult
3  Charlie   26        Delhi      M    charlie@example  20-07-2021   adult
4    David   22       Mumbai      M  david@example.com  12-11-2019   adult
5    Alice   28        Delhi      F     eve@domain.com  01-05-2021   adult
6    Alice   25     New York      F  alice@example.com  01-05-2021   adult
7    Alice   25     New York      F  alice@example.com  01-05-2021   adult
8  Charlie   26        Delhi      M    charlie@example  20-07-2021   adult